hrajoria/Wearable-Cardiac-Monitor-JY16-Capstone/PSOC/Master/Master.cydsn/Generated_Source/PSoC6/sdSPI.h
/***************************************************************************//**
* \file sdSPI.h
* \version 2.0
*
*  This file provides constants and parameter values for the SPI component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(sdSPI_CY_SCB_SPI_PDL_H)
#define sdSPI_CY_SCB_SPI_PDL_H

#include "cyfitter.h"
#include "scb/cy_scb_spi.h"

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_general
* @{
*/
/* Component specific functions. */
void sdSPI_Start(void);

/* Basic functions. */
__STATIC_INLINE cy_en_scb_spi_status_t sdSPI_Init(cy_stc_scb_spi_config_t const *config);
__STATIC_INLINE void sdSPI_DeInit(void);
__STATIC_INLINE void sdSPI_Enable(void);
__STATIC_INLINE void sdSPI_Disable(void);

/* Register callback. */
__STATIC_INLINE void sdSPI_RegisterCallback(cy_cb_scb_spi_handle_events_t callback);

/* Bus state. */
__STATIC_INLINE bool sdSPI_IsBusBusy(void);

/* Slave select control. */
__STATIC_INLINE void sdSPI_SetActiveSlaveSelect(cy_en_scb_spi_slave_select_t slaveSelect);
__STATIC_INLINE void sdSPI_SetActiveSlaveSelectPolarity(cy_en_scb_spi_slave_select_t slaveSelect, 
                                                                   cy_en_scb_spi_polarity_t polarity);

/* Low level: read. */
__STATIC_INLINE uint32_t sdSPI_Read(void);
__STATIC_INLINE uint32_t sdSPI_ReadArray(void *buffer, uint32_t size);
__STATIC_INLINE uint32_t sdSPI_GetRxFifoStatus(void);
__STATIC_INLINE void     sdSPI_ClearRxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t sdSPI_GetNumInRxFifo(void);
__STATIC_INLINE void     sdSPI_ClearRxFifo(void);

/* Low level: write. */
__STATIC_INLINE uint32_t sdSPI_Write(uint32_t data);
__STATIC_INLINE uint32_t sdSPI_WriteArray(void *buffer, uint32_t size);
__STATIC_INLINE void     sdSPI_WriteArrayBlocking(void *buffer, uint32_t size);
__STATIC_INLINE uint32_t sdSPI_GetTxFifoStatus(void);
__STATIC_INLINE void     sdSPI_ClearTxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t sdSPI_GetNumInTxFifo(void);
__STATIC_INLINE bool     sdSPI_IsTxComplete(void);
__STATIC_INLINE void     sdSPI_ClearTxFifo(void);

/* Master/slave specific status. */
__STATIC_INLINE uint32_t sdSPI_GetSlaveMasterStatus(void);
__STATIC_INLINE void     sdSPI_ClearSlaveMasterStatus(uint32_t clearMask);

/* High level: transfer functions. */
__STATIC_INLINE cy_en_scb_spi_status_t sdSPI_Transfer(void *txBuffer, void *rxBuffer, uint32_t size);
__STATIC_INLINE void     sdSPI_AbortTransfer(void);
__STATIC_INLINE uint32_t sdSPI_GetTransferStatus(void);
__STATIC_INLINE uint32_t sdSPI_GetNumTransfered(void);

/* Interrupt handler */
__STATIC_INLINE void sdSPI_Interrupt(void);
/** @} group_general */


/***************************************
*    Variables with External Linkage
***************************************/
/**
* \addtogroup group_globals
* @{
*/
extern uint8_t sdSPI_initVar;
extern cy_stc_scb_spi_config_t const sdSPI_config;
extern cy_stc_scb_spi_context_t sdSPI_context;
/** @} group_globals */


/***************************************
*         Preprocessor Macros
***************************************/
/**
* \addtogroup group_macros
* @{
*/
/** The pointer to the base address of the hardware */
#define sdSPI_HW     ((CySCB_Type *) sdSPI_SCB__HW)

/** The slave select line 0 constant which takes into account pin placement */
#define sdSPI_SPI_SLAVE_SELECT0    ( (cy_en_scb_spi_slave_select_t) sdSPI_SCB__SS0_POSITION)

/** The slave select line 1 constant which takes into account pin placement */
#define sdSPI_SPI_SLAVE_SELECT1    ( (cy_en_scb_spi_slave_select_t) sdSPI_SCB__SS1_POSITION)

/** The slave select line 2 constant which takes into account pin placement */
#define sdSPI_SPI_SLAVE_SELECT2    ( (cy_en_scb_spi_slave_select_t) sdSPI_SCB__SS2_POSITION)

/** The slave select line 3 constant which takes into account pin placement */
#define sdSPI_SPI_SLAVE_SELECT3    ((cy_en_scb_spi_slave_select_t) sdSPI_SCB__SS3_POSITION)
/** @} group_macros */


/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: sdSPI_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_spi_status_t sdSPI_Init(cy_stc_scb_spi_config_t const *config)
{
    return Cy_SCB_SPI_Init(sdSPI_HW, config, &sdSPI_context);
}


/*******************************************************************************
* Function Name: sdSPI_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_DeInit(void)
{
    Cy_SCB_SPI_DeInit(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_Enable(void)
{
    Cy_SCB_SPI_Enable(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_Disable(void)
{
    Cy_SCB_SPI_Disable(sdSPI_HW, &sdSPI_context);
}


/*******************************************************************************
* Function Name: sdSPI_RegisterCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_RegisterCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_RegisterCallback(cy_cb_scb_spi_handle_events_t callback)
{
    Cy_SCB_SPI_RegisterCallback(sdSPI_HW, callback, &sdSPI_context);
}


/*******************************************************************************
* Function Name: sdSPI_IsBusBusy
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_IsBusBusy() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool sdSPI_IsBusBusy(void)
{
    return Cy_SCB_SPI_IsBusBusy(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_SetActiveSlaveSelect
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_SetActiveSlaveSelect() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_SetActiveSlaveSelect(cy_en_scb_spi_slave_select_t slaveSelect)
{
    Cy_SCB_SPI_SetActiveSlaveSelect(sdSPI_HW, slaveSelect);
}


/*******************************************************************************
* Function Name: sdSPI_SetActiveSlaveSelectPolarity
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_SetActiveSlaveSelectPolarity() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_SetActiveSlaveSelectPolarity(cy_en_scb_spi_slave_select_t slaveSelect, 
                                                                   cy_en_scb_spi_polarity_t polarity)
{
    Cy_SCB_SPI_SetActiveSlaveSelectPolarity(sdSPI_HW, slaveSelect, polarity);
}


/*******************************************************************************
* Function Name: sdSPI_Read
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_Read() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_Read(void)
{
    return Cy_SCB_SPI_Read(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_ReadArray
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_ReadArray() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_ReadArray(void *buffer, uint32_t size)
{
    return Cy_SCB_SPI_ReadArray(sdSPI_HW, buffer, size);
}


/*******************************************************************************
* Function Name: sdSPI_GetRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_GetRxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_GetRxFifoStatus(void)
{
    return Cy_SCB_SPI_GetRxFifoStatus(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_ClearRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_ClearRxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_ClearRxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_SPI_ClearRxFifoStatus(sdSPI_HW, clearMask);
}


/*******************************************************************************
* Function Name: sdSPI_GetNumInRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_GetNumInRxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_GetNumInRxFifo(void)
{
    return Cy_SCB_GetNumInRxFifo(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_ClearRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_ClearRxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_ClearRxFifo(void)
{
    Cy_SCB_SPI_ClearRxFifo(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_Write
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_Write() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_Write(uint32_t data)
{
    return Cy_SCB_SPI_Write(sdSPI_HW, data);
}


/*******************************************************************************
* Function Name: sdSPI_WriteArray
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_WriteArray() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_WriteArray(void *buffer, uint32_t size)
{
    return Cy_SCB_SPI_WriteArray(sdSPI_HW, buffer, size);
}


/*******************************************************************************
* Function Name: sdSPI_WriteArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_WriteArrayBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_WriteArrayBlocking(void *buffer, uint32_t size)
{
    Cy_SCB_SPI_WriteArrayBlocking(sdSPI_HW, buffer, size);
}


/*******************************************************************************
* Function Name: sdSPI_GetTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_GetTxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_GetTxFifoStatus(void)
{
    return Cy_SCB_SPI_GetTxFifoStatus(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_ClearTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_ClearTxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_ClearTxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_SPI_ClearTxFifoStatus(sdSPI_HW, clearMask);
}


/*******************************************************************************
* Function Name: sdSPI_GetNumInTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_GetNumInTxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_GetNumInTxFifo(void)
{
    return Cy_SCB_SPI_GetNumInTxFifo(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_IsTxComplete
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_IsTxComplete() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool sdSPI_IsTxComplete(void)
{
    return Cy_SCB_SPI_IsTxComplete(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_ClearTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_ClearTxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_ClearTxFifo(void)
{
    Cy_SCB_SPI_ClearTxFifo(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_GetSlaveMasterStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_GetSlaveMasterStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_GetSlaveMasterStatus(void)
{
    return Cy_SCB_SPI_GetSlaveMasterStatus(sdSPI_HW);
}


/*******************************************************************************
* Function Name: sdSPI_ClearSlaveMasterStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_ClearSlaveMasterStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_ClearSlaveMasterStatus(uint32_t clearMask)
{
    Cy_SCB_SPI_ClearSlaveMasterStatus(sdSPI_HW, clearMask);
}


/*******************************************************************************
* Function Name: sdSPI_Transfer
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_Transfer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_spi_status_t sdSPI_Transfer(void *txBuffer, void *rxBuffer, uint32_t size)
{
    return Cy_SCB_SPI_Transfer(sdSPI_HW, txBuffer, rxBuffer, size, &sdSPI_context);
}

/*******************************************************************************
* Function Name: sdSPI_AbortTransfer
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_AbortTransfer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_AbortTransfer(void)
{
    Cy_SCB_SPI_AbortTransfer(sdSPI_HW, &sdSPI_context);
}


/*******************************************************************************
* Function Name: sdSPI_GetTransferStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_GetTransferStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_GetTransferStatus(void)
{
    return Cy_SCB_SPI_GetTransferStatus(sdSPI_HW, &sdSPI_context);
}


/*******************************************************************************
* Function Name: sdSPI_GetNumTransfered
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_GetNumTransfered() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t sdSPI_GetNumTransfered(void)
{
    return Cy_SCB_SPI_GetNumTransfered(sdSPI_HW, &sdSPI_context);
}


/*******************************************************************************
* Function Name: sdSPI_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_SPI_Interrupt() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void sdSPI_Interrupt(void)
{
    Cy_SCB_SPI_Interrupt(sdSPI_HW, &sdSPI_context);
}


#if defined(__cplusplus)
}
#endif

#endif /* sdSPI_CY_SCB_SPI_PDL_H */


/* [] END OF FILE */
